# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireConduitTypeSet..::..Erase Method
WireConduitTypeSet Class See Also
---
Removes a specified conduit type from the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	WireConduitType item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As WireConduitType _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	WireConduitType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..WireConduitTypeThe conduit type to be erased.
# ### Return Value
The number of conduit types that were erased from the set.
# See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace